app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    if(current_user.admin?)
      @posts = Post.all

INSERT INTO "posts" ("title", "body", "rating", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    authorize @post
    respond_to do |format|
      if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]
---
  def destroy
    authorize @post
    @post.destroy